sdc_files/artillery/mongoConfig.yml
config:
  target: 'http://localhost:3005'
  # http:
  #   pool: 200
  phases:
    - duration: 60
      arrivalCount: 5000
  variables:
    date:
      - '2018-03-23'
      - '2018-03-28'
      - '2018-03-30'
      - '2018-04-05'
      - '2018-04-11'
      - '2018-04-17'
      - '2018-04-23'
      - '2018-04-26'
      - '2018-04-28'
      - '2018-05-05'
      - '2018-05-07'
      - '2018-05-11'
      - '2018-05-15'
      - '2018-05-22'
      - '2018-06-06'
      - '2018-06-07'
      - '2018-06-11'
      - '2018-06-15'
      - '2018-06-22'
      - '2018-07-07'
      - '2018-07-11'
      - '2018-07-15'
      - '2018-07-22'
  # http:
  #   pool: 200

scenarios:
  - flow:
    - loop:
      # - log: "Requesting route: /restaurants/{{$loopElement}}/reservations/{{date}}"  
      - get:
          url: "/restaurants/{{$loopElement}}/reservations/{{date}}"
    # - post:
        # url: "/reservations/"
        # json:
        #   restaurantId: "{{ restaurantId }}"
        #   date: "{{ date }}"
        #   time: "{{ time }}"
        #   name: "{{ name }}"
        #   party: "{{ party }}"
        #   timeStamp: "{{ timeStamp }}"
      over:
        - 863259
        - 7580563
        - 2213861
        - 3644778
        - 1704171
        - 4752742
        - 2311296
        - 2679771
        - 6573077
        - 300131
        - 5651930
        - 3852660
        - 8400076
        - 3316342
        - 148830
        - 3691093
        - 6906289
        - 9313234
        - 1230546
        - 8641633
        - 544198
        - 2246240
        - 5964234
        - 7242006
        - 9407406
        # - 3864096
        # - 6125948
        # - 8192082
        # - 6383680
        # - 6574336
        # - 2569792
        # - 5657386
        # - 5141471
        # - 6876284
        # - 8352991
        # - 4558819
        # - 1801935
        # - 3690806
        # - 2639034
        # - 140623
        # - 2766744
        # - 7986800
        # - 8952197
        # - 5803322
        # - 676153
        # - 1077071
        # - 2529118
        # - 5584340
        # - 1128422
        # - 3114393
        # - 6249542
        # - 4039116
        # - 9240022
        # - 8548762
        # - 5068151
        # - 6518189
        # - 6178889
        # - 4140814
        # - 7992789
        # - 8847940
        # - 9420954
        # - 3869194
        # - 9169396
        # - 5261880
        # - 5065710
        # - 6816478
        # - 6191430
        # - 5921576
        # - 2749154
        # - 6787631
        # - 6743611
        # - 8530449
        # - 8556387
        # - 4434943
        # - 1705762
        # - 3922012
        # - 8313019
        # - 6114339
        # - 353237
        # - 5787869
        # - 2638604
        # - 200976
        # - 5024580
        # - 4534013
        # - 5131485
        # - 9548561
        # - 7057560
        # - 7061688
        # - 7635078
        # - 6323838
        # - 5852412
        # - 7951067
        # - 6988596
        # - 4285826
        # - 6481389
        # - 4170319
        # - 9516689
        # - 1845904
        # - 2195327
        # - 8801904
        # - 4723039
        # - 616880
        # - 3983204
        # - 6104014
        # - 4457441
        # - 6723395
        # - 403548
        # - 4832761
        # - 955087
        # - 769228
        # - 8816255
        # - 665703
        # - 4455232
        # - 8627501
        # - 9590539
        # - 1157343
        # - 522332
        # - 2403324
        # - 4103334
        # - 8643640
        # - 2310408
        # - 880646
        # - 144029
        # - 7345169
        # - 5053707
        # - 1465287
        # - 5638696
        # - 125725
        # - 807617
        # - 8437176
        # - 4278450
        # - 2144665
        # - 533283
        # - 3492637
        # - 5502268
        # - 351143
        # - 9227630
        # - 5559603
        # - 5438500
        # - 7964970
        # - 3732302
        # - 6618298
        # - 4670469
        # - 5579427
        # - 3540993
        # - 961068
        # - 2525213
        # - 4576312
        # - 3063480
        # - 7983647
        # - 9648468
        # - 7979546
        # - 4654914
        # - 3970745
        # - 5219427
        # - 586047
        # - 5788980
        # - 1953965
        # - 1651859
        # - 8073926
        # - 6681293
        # - 6022662
        # - 3884801
        # - 7746205
        # - 847907
        # - 3732239
        # - 4888490
        # - 4822786
        # - 2595040
        # - 8852466
        # - 8152475
        # - 7483508
        # - 8706015
        # - 5893829
        # - 5925397
        # - 272759
        # - 500917
        # - 2626529
        # - 8149444
        # - 9087920
        # - 6591881
        # - 8279251
        # - 2523218
        # - 70439
        # - 2404436
        # - 540884
        # - 4908461
        # - 2279175
        # - 213666
        # - 378473
        # - 8417331
        # - 7635182
        # - 2103777
        # - 6822448
        # - 3320503
        # - 4196796
        # - 4572982
        # - 4699359
        # - 2896340
        # - 582213
      count: 1